# jet up to 3 loops from https://arxiv.org/abs/2012.07859

using Distributed
include("..\\strong coupling\\constants.jl")

# jet function

@everywhere function J1_func(αs,Lb,LQ,nf)

    J1 = (
        1 + (CF*αs)/π + (3*CF*Lb*αs)/(4*π) + 
        (CF*Lb*LQ*αs)/π - (CF*π*αs)/3
    )

    return J1
end

@everywhere function J2_func(αs,Lb,LQ,nf)

    J2 = (
        - 
        (89*CA*CF*αs^2)/144 - (7*CF^2*αs^2)/24 - 
        (11*CA*CF*Lb*αs^2)/72 - (3*CF^2*Lb*αs^2)/8 - 
        (CA*CF*Lb*LQ*αs^2)/12 - (CF^2*Lb*LQ*αs^2)/3 + 
        (1549*CA*CF*αs^2)/(1152*π^2) + (139*CF^2*αs^2)/
         (384*π^2) + (35*CA*CF*Lb*αs^2)/(32*π^2) + 
        (27*CF^2*Lb*αs^2)/(32*π^2) + (11*CA*CF*Lb^2*αs^2)/
         (32*π^2) + (9*CF^2*Lb^2*αs^2)/(32*π^2) + 
        (101*CA*CF*LQ*αs^2)/(54*π^2) + (67*CA*CF*Lb*LQ*αs^2)/
         (36*π^2) + (CF^2*Lb*LQ*αs^2)/π^2 + 
        (11*CA*CF*Lb^2*LQ*αs^2)/(24*π^2) + (3*CF^2*Lb^2*LQ*αs^2)/
         (4*π^2) + (CF^2*Lb^2*LQ^2*αs^2)/(2*π^2) - 
        (CA*CF*π^2*αs^2)/288 + (7*CF^2*π^2*αs^2)/72 + 
        (7*CF*nf*TF*αs^2)/36 + (CF*Lb*nf*TF*αs^2)/18 - 
        (149*CF*nf*TF*αs^2)/(288*π^2) - (3*CF*Lb*nf*TF*αs^2)/
         (8*π^2) - (CF*Lb^2*nf*TF*αs^2)/(8*π^2) - 
        (14*CF*LQ*nf*TF*αs^2)/(27*π^2) - (5*CF*Lb*LQ*nf*TF*αs^2)/
         (9*π^2) - (CF*Lb^2*LQ*nf*TF*αs^2)/(6*π^2)
    )

    return J2
end

@everywhere function J3_func(αs,Lb,LQ,nf)

    J3 = (
        (173785*CA^2*CF*αs^3)/(124416*π^3) + (24673*CA*CF^2*αs^3)/
        (13824*π^3) + (163*CF^3*αs^3)/(256*π^3) + 
       (4241*CA^2*CF*Lb*αs^3)/(1728*π^3) + 
       (11239*CA*CF^2*Lb*αs^3)/(4608*π^3) + (303*CF^3*Lb*αs^3)/
        (512*π^3) + (487*CA^2*CF*Lb^2*αs^3)/(384*π^3) + 
       (5*CA*CF^2*Lb^2*αs^3)/(4*π^3) + (45*CF^3*Lb^2*αs^3)/
        (128*π^3) + (121*CA^2*CF*Lb^3*αs^3)/(576*π^3) + 
       (33*CA*CF^2*Lb^3*αs^3)/(128*π^3) + (9*CF^3*Lb^3*αs^3)/
        (128*π^3) + (297029*CA^2*CF*LQ*αs^3)/(46656*π^3) + 
       (101*CA*CF^2*LQ*αs^3)/(54*π^3) + 
       (15503*CA^2*CF*Lb*LQ*αs^3)/(2592*π^3) + 
       (5309*CA*CF^2*Lb*LQ*αs^3)/(1152*π^3) + 
       (139*CF^3*Lb*LQ*αs^3)/(384*π^3) + 
       (445*CA^2*CF*Lb^2*LQ*αs^3)/(216*π^3) + 
       (283*CA*CF^2*Lb^2*LQ*αs^3)/(96*π^3) + 
       (27*CF^3*Lb^2*LQ*αs^3)/(32*π^3) + 
       (121*CA^2*CF*Lb^3*LQ*αs^3)/(432*π^3) + 
       (11*CA*CF^2*Lb^3*LQ*αs^3)/(16*π^3) + (9*CF^3*Lb^3*LQ*αs^3)/
        (32*π^3) + (101*CA*CF^2*Lb*LQ^2*αs^3)/(54*π^3) + 
       (67*CA*CF^2*Lb^2*LQ^2*αs^3)/(36*π^3) + 
       (CF^3*Lb^2*LQ^2*αs^3)/(2*π^3) + 
       (11*CA*CF^2*Lb^3*LQ^2*αs^3)/(24*π^3) + 
       (3*CF^3*Lb^3*LQ^2*αs^3)/(8*π^3) + (CF^3*Lb^3*LQ^3*αs^3)/
        (6*π^3) - (107441*CA^2*CF*αs^3)/(62208*π) - 
       (3751*CA*CF^2*αs^3)/(2592*π) + (11*CF^3*αs^3)/(576*π) - 
       (2425*CA^2*CF*Lb*αs^3)/(2592*π) - (121*CA*CF^2*Lb*αs^3)/
        (96*π) - (21*CF^3*Lb*αs^3)/(64*π) - 
       (121*CA^2*CF*Lb^2*αs^3)/(864*π) - (11*CA*CF^2*Lb^2*αs^3)/
        (32*π) - (3*CF^3*Lb^2*αs^3)/(16*π) - 
       (799*CA^2*CF*LQ*αs^3)/(3888*π) - (101*CA*CF^2*LQ*αs^3)/
        (162*π) - (67*CA^2*CF*Lb*LQ*αs^3)/(216*π) - 
       (571*CA*CF^2*Lb*LQ*αs^3)/(432*π) - (7*CF^3*Lb*LQ*αs^3)/
        (24*π) - (11*CA^2*CF*Lb^2*LQ*αs^3)/(144*π) - 
       (53*CA*CF^2*Lb^2*LQ*αs^3)/(144*π) - (3*CF^3*Lb^2*LQ*αs^3)/
        (8*π) - (CA*CF^2*Lb^2*LQ^2*αs^3)/(12*π) - 
       (CF^3*Lb^2*LQ^2*αs^3)/(6*π) + (3979*CA^2*CF*π*αs^3)/
        124416 + (2311*CA*CF^2*π*αs^3)/7776 + 
       (27*CF^3*π*αs^3)/640 - (25*CA^2*CF*Lb*π*αs^3)/3456 + 
       (1661*CA*CF^2*Lb*π*αs^3)/17280 + (67*CF^3*Lb*π*αs^3)/
        480 - (77*CA^2*CF*LQ*π*αs^3)/8640 + 
       (11*CA^2*CF*Lb*LQ*π*αs^3)/720 + (7*CA*CF^2*Lb*LQ*π*αs^3)/
        288 + (7*CF^3*Lb*LQ*π*αs^3)/72 + (31*CA^2*CF*π^3*αs^3)/
        68040 + (451*CA*CF^2*π^3*αs^3)/108864 - 
       (8531*CF^3*π^3*αs^3)/272160 - (16895*CA*CF*nf*TF*αs^3)/
        (15552*π^3) - (3761*CF^2*nf*TF*αs^3)/(1728*π^3) - 
       (707*CA*CF*Lb*nf*TF*αs^3)/(432*π^3) - 
       (1889*CF^2*Lb*nf*TF*αs^3)/(1152*π^3) - 
       (83*CA*CF*Lb^2*nf*TF*αs^3)/(96*π^3) - 
       (17*CF^2*Lb^2*nf*TF*αs^3)/(32*π^3) - 
       (11*CA*CF*Lb^3*nf*TF*αs^3)/(72*π^3) - 
       (3*CF^2*Lb^3*nf*TF*αs^3)/(32*π^3) - 
       (31313*CA*CF*LQ*nf*TF*αs^3)/(11664*π^3) - 
       (2159*CF^2*LQ*nf*TF*αs^3)/(864*π^3) - 
       (2051*CA*CF*Lb*LQ*nf*TF*αs^3)/(648*π^3) - 
       (751*CF^2*Lb*LQ*nf*TF*αs^3)/(288*π^3) - 
       (289*CA*CF*Lb^2*LQ*nf*TF*αs^3)/(216*π^3) - 
       (13*CF^2*Lb^2*LQ*nf*TF*αs^3)/(12*π^3) - 
       (11*CA*CF*Lb^3*LQ*nf*TF*αs^3)/(54*π^3) - 
       (CF^2*Lb^3*LQ*nf*TF*αs^3)/(4*π^3) - 
       (14*CF^2*Lb*LQ^2*nf*TF*αs^3)/(27*π^3) - 
       (5*CF^2*Lb^2*LQ^2*nf*TF*αs^3)/(9*π^3) - 
       (CF^2*Lb^3*LQ^2*nf*TF*αs^3)/(6*π^3) + 
       (7475*CA*CF*nf*TF*αs^3)/(7776*π) + (997*CF^2*nf*TF*αs^3)/
        (1296*π) + (421*CA*CF*Lb*nf*TF*αs^3)/(648*π) + 
       (5*CF^2*Lb*nf*TF*αs^3)/(12*π) + (11*CA*CF*Lb^2*nf*TF*αs^3)/
        (108*π) + (CF^2*Lb^2*nf*TF*αs^3)/(8*π) + 
       (103*CA*CF*LQ*nf*TF*αs^3)/(1944*π) + 
       (14*CF^2*LQ*nf*TF*αs^3)/(81*π) + 
       (5*CA*CF*Lb*LQ*nf*TF*αs^3)/(54*π) + 
       (41*CF^2*Lb*LQ*nf*TF*αs^3)/(108*π) + 
       (CA*CF*Lb^2*LQ*nf*TF*αs^3)/(36*π) + 
       (CF^2*Lb^2*LQ*nf*TF*αs^3)/(9*π) - 
       (487*CA*CF*nf*π*TF*αs^3)/77760 - (3547*CF^2*nf*π*TF*αs^3)/
        38880 + (13*CA*CF*Lb*nf*π*TF*αs^3)/4320 - 
       (71*CF^2*Lb*nf*π*TF*αs^3)/2160 - (CA*CF*LQ*nf*π*TF*αs^3)/
        432 + (CF^2*LQ*nf*π*TF*αs^3)/180 + 
       (793*CF*nf^2*TF^2*αs^3)/(7776*π^3) + 
       (49*CF*Lb*nf^2*TF^2*αs^3)/(216*π^3) + 
       (CF*Lb^2*nf^2*TF^2*αs^3)/(8*π^3) + 
       (CF*Lb^3*nf^2*TF^2*αs^3)/(36*π^3) + 
       (116*CF*LQ*nf^2*TF^2*αs^3)/(729*π^3) + 
       (25*CF*Lb*LQ*nf^2*TF^2*αs^3)/(81*π^3) + 
       (5*CF*Lb^2*LQ*nf^2*TF^2*αs^3)/(27*π^3) + 
       (CF*Lb^3*LQ*nf^2*TF^2*αs^3)/(27*π^3) - 
       (11*CF*nf^2*TF^2*αs^3)/(108*π) - (8*CF*Lb*nf^2*TF^2*αs^3)/
        (81*π) - (CF*Lb^2*nf^2*TF^2*αs^3)/(54*π) - 
       (7*CF*nf^2*π*TF^2*αs^3)/2430 + (37*CA*CF*αs^2*z3)/
        (24*π^2) - (37*CF^2*αs^2*z3)/(8*π^2) - 
       (3*CA*CF*Lb*αs^2*z3)/(4*π^2) + 
       (3*CF^2*Lb*αs^2*z3)/(2*π^2) - 
       (7*CA*CF*LQ*αs^2*z3)/(4*π^2) + 
       (CF*nf*TF*αs^2*z3)/(6*π^2) + 
       (98269*CA^2*CF*αs^3*z3)/(10368*π^3) - 
       (691*CA*CF^2*αs^3*z3)/(27*π^3) + (CF^3*αs^3*z3)/
        (6*π^3) + (19*CA^2*CF*Lb*αs^3*z3)/(144*π^3) - 
       (353*CA*CF^2*Lb*αs^3*z3)/(96*π^3) - 
       (29*CF^3*Lb*αs^3*z3)/(32*π^3) - 
       (11*CA^2*CF*Lb^2*αs^3*z3)/(16*π^3) + 
       (13*CA*CF^2*Lb^2*αs^3*z3)/(16*π^3) + 
       (9*CF^3*Lb^2*αs^3*z3)/(8*π^3) - 
       (1541*CA^2*CF*LQ*αs^3*z3)/(216*π^3) - 
       (7*CA*CF^2*LQ*αs^3*z3)/(4*π^3) - 
       (11*CA^2*CF*Lb*LQ*αs^3*z3)/(4*π^3) + 
       (11*CA*CF^2*Lb*LQ*αs^3*z3)/(48*π^3) - 
       (37*CF^3*Lb*LQ*αs^3*z3)/(8*π^3) - 
       (3*CA*CF^2*Lb^2*LQ*αs^3*z3)/(4*π^3) + 
       (3*CF^3*Lb^2*LQ*αs^3*z3)/(2*π^3) - 
       (7*CA*CF^2*Lb*LQ^2*αs^3*z3)/(4*π^3) + 
       (67*CA^2*CF*αs^3*z3)/(192*π) - 
       (107*CA*CF^2*αs^3*z3)/(432*π) + 
       (25*CF^3*αs^3*z3)/(16*π) + 
       (7*CA*CF^2*Lb*αs^3*z3)/(24*π) - 
       (7*CF^3*Lb*αs^3*z3)/(12*π) + 
       (11*CA^2*CF*LQ*αs^3*z3)/(72*π) + 
       (7*CA*CF^2*LQ*αs^3*z3)/(12*π) + 
       (29*CA*CF*nf*TF*αs^3*z3)/(162*π^3) + 
       (1573*CF^2*nf*TF*αs^3*z3)/(216*π^3) - 
       (CA*CF*Lb*nf*TF*αs^3*z3)/(36*π^3) + 
       (43*CF^2*Lb*nf*TF*αs^3*z3)/(24*π^3) + 
       (CA*CF*Lb^2*nf*TF*αs^3*z3)/(4*π^3) - 
       (CF^2*Lb^2*nf*TF*αs^3*z3)/(2*π^3) + 
       (113*CA*CF*LQ*nf*TF*αs^3*z3)/(108*π^3) + 
       (19*CF^2*LQ*nf*TF*αs^3*z3)/(18*π^3) + 
       (7*CF^2*Lb*LQ*nf*TF*αs^3*z3)/(6*π^3) + 
       (5*CA*CF*nf*TF*αs^3*z3)/(72*π) - 
       (13*CF^2*nf*TF*αs^3*z3)/(54*π) - 
       (167*CF*nf^2*TF^2*αs^3*z3)/(162*π^3) - 
       (2*CF*Lb*nf^2*TF^2*αs^3*z3)/(9*π^3) + 
       (2*CF*LQ*nf^2*TF^2*αs^3*z3)/(9*π^3) + 
       (7*CA^2*CF*αs^3*z3^2)/(24*π^3) + 
       (23*CA*CF^2*αs^3*z3^2)/(24*π^3) - 
       (31*CF^3*αs^3*z3^2)/(12*π^3) - 
       (719*CA^2*CF*αs^3*z5)/(48*π^3) + 
       (2405*CA*CF^2*αs^3*z5)/(144*π^3) + 
       (251*CF^3*αs^3*z5)/(24*π^3) + 
       (5*CA^2*CF*Lb*αs^3*z5)/(8*π^3) + 
       (15*CA*CF^2*Lb*αs^3*z5)/(8*π^3) - 
       (15*CF^3*Lb*αs^3*z5)/(4*π^3) + 
       (3*CA^2*CF*LQ*αs^3*z5)/π^3 + 
       (7*CA*CF*nf*TF*αs^3*z5)/(2*π^3) - 
       (37*CF^2*nf*TF*αs^3*z5)/(9*π^3)
    )

    return J3
end

@everywhere function J_func(; b::Float64, μJ::Float64, νdQ::Float64, αs::Float64, order::Int64, nf::Int64)

    Lb = log((b*μJ/b0)^2)
    LQ = log(νdQ)

    J1 = J1_func(αs,Lb,LQ,nf)
    J2 = J2_func(αs,Lb,LQ,nf)
    J3 = J3_func(αs,Lb,LQ,nf)

    if order == 1 
        total = J1
    end
    if order == 2  
        total = J1 + J2
    end
    if order == 3 
        total = J1 + J2 + J3
    end

    return total

end
